SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_prs.h
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS2_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_CLK_SET;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_IR_SET; /**< IR Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_RX_SET; /**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_TRIGGER_SET;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED11[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_VDAC0_ASYNCTRIGCH0_SET;/**< ASYNCTRIG consumer register                        */
  __IOM uint32_t             CONSUMER_VDAC0_ASYNCTRIGCH1_SET;/**< ASYNCTRIG Consumer register                        */
  __IOM uint32_t             CONSUMER_VDAC0_SYNCTRIGCH0_SET;/**< SYNCTRIG Consumer register                         */
  __IOM uint32_t             CONSUMER_VDAC0_SYNCTRIGCH1_SET;/**< SYNCTRIG Consumer register                         */
  __IOM uint32_t             CONSUMER_WDOG0_SRC0_SET;/**< SRC0 consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG0_SRC1_SET;/**< SRC1 Consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG1_SRC0_SET;/**< SRC0 consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG1_SRC1_SET;/**< SRC1 Consumer register                             */
        uint32_t             RESERVED12[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED13[893U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< PRS IPVERSION                                      */
        uint32_t             RESERVED14[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             ASYNC_SWPULSE_CLR;      /**< Software Pulse Register                            */
  __IOM uint32_t             ASYNC_SWLEVEL_CLR;      /**< Software Level Register                            */
  __IM  uint32_t             ASYNC_PEEK_CLR;         /**< Async Channel Values                               */
  __IM  uint32_t             SYNC_PEEK_CLR;          /**< Sync Channel Values                                */
        PRS_ASYNC_CH_TypeDef ASYNC_CH_CLR[12U]; /**< Async Channel registers                            */
        PRS_SYNC_CH_TypeDef  SYNC_CH_CLR[4U];   /**< Sync Channel registers                             */
  __IOM uint32_t             CONSUMER_CMU_CALDN_CLR; /**< CALDN consumer register                            */
  __IOM uint32_t             CONSUMER_CMU_CALUP_CLR; /**< CALUP Consumer register                            */
  __IOM uint32_t             CONSUMER_EUSART0_CLK_CLR;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART0_RX_CLR;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART0_TRIGGER_CLR;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART1_CLK_CLR;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART1_RX_CLR;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART1_TRIGGER_CLR;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART2_CLK_CLR;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART2_RX_CLR;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART2_TRIGGER_CLR;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED15[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_IADC0_SCANTRIGGER_CLR;/**< SCAN consumer register                             */
  __IOM uint32_t             CONSUMER_IADC0_SINGLETRIGGER_CLR;/**< SINGLE Consumer register                           */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ0_CLR;/**< DMAREQ0 consumer register                          */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ1_CLR;/**< DMAREQ1 Consumer register                          */
        uint32_t             RESERVED16[4U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_LESENSE_START_CLR;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_CLEAR_CLR;/**< CLEAR consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_START_CLR;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_STOP_CLR;/**< STOP Consumer register                             */
  __IOM uint32_t             CONSUMER_MODEM_DIN_CLR; /**< MODEM DIN consumer register                        */
  __IOM uint32_t             CONSUMER_PCNT0_S0IN_CLR;/**< S0IN consumer register                             */
  __IOM uint32_t             CONSUMER_PCNT0_S1IN_CLR;/**< S1IN Consumer register                             */
        uint32_t             RESERVED17[11U];        /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_RAC_CLR_CLR;   /**< CLR consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN0_CLR;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN1_CLR;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN2_CLR;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN3_CLR;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_FORCETX_CLR;/**< FORCETX Consumer register                          */
  __IOM uint32_t             CONSUMER_RAC_RXDIS_CLR; /**< RXDIS Consumer register                            */
  __IOM uint32_t             CONSUMER_RAC_RXEN_CLR;  /**< RXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_RAC_TXEN_CLR;  /**< TXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC25_CLR;/**< TAMPERSRC25 consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC26_CLR;/**< TAMPERSRC26 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC27_CLR;/**< TAMPERSRC27 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC28_CLR;/**< TAMPERSRC28 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC29_CLR;/**< TAMPERSRC29 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC30_CLR;/**< TAMPERSRC30 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC31_CLR;/**< TAMPERSRC31 Consumer register                      */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN0_CLR;/**< IN0 consumer register                              */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN1_CLR;/**< IN1 Consumer register                              */
  __IOM uint32_t             CONSUMER_HFXO0_OSCREQ_CLR;/**< OSCREQ consumer register                           */
  __IOM uint32_t             CONSUMER_HFXO0_TIMEOUT_CLR;/**< TIMEOUT Consumer register                          */
  __IOM uint32_t             CONSUMER_CORE_CTIIN0_CLR;/**< CTI0 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN1_CLR;/**< CTI1 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN2_CLR;/**< CTI2 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN3_CLR;/**< CTI3 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_M33RXEV_CLR;/**< M33 Consumer Selection                             */
  __IOM uint32_t             CONSUMER_TIMER0_CC0_CLR;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC1_CLR;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC2_CLR;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTI_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS1_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS2_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC0_CLR;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC1_CLR;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC2_CLR;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTI_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS1_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS2_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC0_CLR;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC1_CLR;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC2_CLR;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTI_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS1_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS2_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC0_CLR;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC1_CLR;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC2_CLR;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTI_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS1_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS2_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC0_CLR;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC1_CLR;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC2_CLR;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTI_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS1_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS2_CLR;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_CLK_CLR;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_IR_CLR; /**< IR Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_RX_CLR; /**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_TRIGGER_CLR;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED18[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_VDAC0_ASYNCTRIGCH0_CLR;/**< ASYNCTRIG consumer register                        */
  __IOM uint32_t             CONSUMER_VDAC0_ASYNCTRIGCH1_CLR;/**< ASYNCTRIG Consumer register                        */
  __IOM uint32_t             CONSUMER_VDAC0_SYNCTRIGCH0_CLR;/**< SYNCTRIG Consumer register                         */
  __IOM uint32_t             CONSUMER_VDAC0_SYNCTRIGCH1_CLR;/**< SYNCTRIG Consumer register                         */
  __IOM uint32_t             CONSUMER_WDOG0_SRC0_CLR;/**< SRC0 consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG0_SRC1_CLR;/**< SRC1 Consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG1_SRC0_CLR;/**< SRC0 consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG1_SRC1_CLR;/**< SRC1 Consumer register                             */
        uint32_t             RESERVED19[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED20[893U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< PRS IPVERSION                                      */
        uint32_t             RESERVED21[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             ASYNC_SWPULSE_TGL;      /**< Software Pulse Register                            */
  __IOM uint32_t             ASYNC_SWLEVEL_TGL;      /**< Software Level Register                            */
  __IM  uint32_t             ASYNC_PEEK_TGL;         /**< Async Channel Values                               */
  __IM  uint32_t             SYNC_PEEK_TGL;          /**< Sync Channel Values                                */
        PRS_ASYNC_CH_TypeDef ASYNC_CH_TGL[12U]; /**< Async Channel registers                            */
        PRS_SYNC_CH_TypeDef  SYNC_CH_TGL[4U];   /**< Sync Channel registers                             */
  __IOM uint32_t             CONSUMER_CMU_CALDN_TGL; /**< CALDN consumer register                            */
  __IOM uint32_t             CONSUMER_CMU_CALUP_TGL; /**< CALUP Consumer register                            */
  __IOM uint32_t             CONSUMER_EUSART0_CLK_TGL;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART0_RX_TGL;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART0_TRIGGER_TGL;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART1_CLK_TGL;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART1_RX_TGL;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART1_TRIGGER_TGL;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART2_CLK_TGL;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART2_RX_TGL;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART2_TRIGGER_TGL;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED22[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_IADC0_SCANTRIGGER_TGL;/**< SCAN consumer register                             */
  __IOM uint32_t             CONSUMER_IADC0_SINGLETRIGGER_TGL;/**< SINGLE Consumer register                           */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ0_TGL;/**< DMAREQ0 consumer register                          */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ1_TGL;/**< DMAREQ1 Consumer register                          */
        uint32_t             RESERVED23[4U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_LESENSE_START_TGL;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_CLEAR_TGL;/**< CLEAR consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_START_TGL;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_STOP_TGL;/**< STOP Consumer register                             */
  __IOM uint32_t             CONSUMER_MODEM_DIN_TGL; /**< MODEM DIN consumer register                        */
  __IOM uint32_t             CONSUMER_PCNT0_S0IN_TGL;/**< S0IN consumer register                             */
  __IOM uint32_t             CONSUMER_PCNT0_S1IN_TGL;/**< S1IN Consumer register                             */
        uint32_t             RESERVED24[11U];        /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_RAC_CLR_TGL;   /**< CLR consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN0_TGL;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN1_TGL;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN2_TGL;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN3_TGL;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_FORCETX_TGL;/**< FORCETX Consumer register                          */
  __IOM uint32_t             CONSUMER_RAC_RXDIS_TGL; /**< RXDIS Consumer register                            */
  __IOM uint32_t             CONSUMER_RAC_RXEN_TGL;  /**< RXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_RAC_TXEN_TGL;  /**< TXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC25_TGL;/**< TAMPERSRC25 consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC26_TGL;/**< TAMPERSRC26 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC27_TGL;/**< TAMPERSRC27 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC28_TGL;/**< TAMPERSRC28 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC29_TGL;/**< TAMPERSRC29 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC30_TGL;/**< TAMPERSRC30 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC31_TGL;/**< TAMPERSRC31 Consumer register                      */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN0_TGL;/**< IN0 consumer register                              */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN1_TGL;/**< IN1 Consumer register                              */
  __IOM uint32_t             CONSUMER_HFXO0_OSCREQ_TGL;/**< OSCREQ consumer register                           */
  __IOM uint32_t             CONSUMER_HFXO0_TIMEOUT_TGL;/**< TIMEOUT Consumer register                          */
  __IOM uint32_t             CONSUMER_CORE_CTIIN0_TGL;/**< CTI0 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN1_TGL;/**< CTI1 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN2_TGL;/**< CTI2 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN3_TGL;/**< CTI3 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_M33RXEV_TGL;/**< M33 Consumer Selection                             */
  __IOM uint32_t             CONSUMER_TIMER0_CC0_TGL;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC1_TGL;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC2_TGL;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTI_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS1_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS2_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC0_TGL;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC1_TGL;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC2_TGL;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTI_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS1_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS2_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC0_TGL;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC1_TGL;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC2_TGL;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTI_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS1_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS2_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC0_TGL;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC1_TGL;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC2_TGL;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTI_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS1_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS2_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC0_TGL;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC1_TGL;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC2_TGL;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTI_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS1_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS2_TGL;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_CLK_TGL;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_IR_TGL; /**< IR Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_RX_TGL; /**< RX Consumer register                               */
